# pandas Hands On Solutions

# MAS DSE200

### Imports

Import necessary packages

In [1]:
import pandas as pd
import numpy as np

### Preliminaries

Grab the dataset from [here](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) and store it in a Pandas dataframe called users

In [2]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|')
users.to_csv('occupations.csv', sep=',', index=False)

In [3]:
users = pd.read_csv('./occupations.csv')

### 1: Get to know your data

**1.1**: Print the first 10 entries in the dataframe to see what the columns are and what some values will look like

In [4]:
users.head(10)

   user_id  age gender     occupation zip_code
0        1   24      M     technician    85711
1        2   53      F          other    94043
2        3   23      M         writer    32067
3        4   24      M     technician    43537
4        5   33      F          other    15213
5        6   42      M      executive    98101
6        7   57      M  administrator    91344
7        8   36      M  administrator    05201
8        9   29      M        student    01002
9       10   53      M         lawyer    90703

**1.2**: Next, set the index of the dataframe to the `user_id` column, and print the first 10 elements again to ensure the change took place

In [5]:
try:
    users.set_index('user_id', inplace=True)
except KeyError:
    print("Index already set")
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

**1.3**: How many samples are there in this dataset?

In [6]:
len(users)

943

### 3:  Occupations

**3.1**: What is the **most** popular occupation according to this dataset?

In [7]:
users.occupation.value_counts().head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64

**3.2**: What is the **least** popular occupation according to this dataset

In [8]:
users.occupation.value_counts().tail()

salesman     12
lawyer       12
none          9
homemaker     7
doctor        7
Name: occupation, dtype: int64

### 4:  Location, location, location

**4.1**: How many zip codes exist in the dataset?

In [9]:
len(users.zip_code.unique())

795

**4.2**: Find the top 100 zip codes in which the most users live. **Report these zip codes**, and then **calculate the total number of users** living in these 100 zip codes.

In [10]:
top_zip_codes_with_counts = users.zip_code.value_counts().head(100)
population_sum = sum(top_zip_codes_with_counts)
top_zip_codes = top_zip_codes_with_counts.keys()
print("The most popular zip codes in the dataset are: ", top_zip_codes)
print(population_sum, "of the users live in these zip codes")

The most popular zip codes in the dataset are:  Index(['55414', '55105', '10003', '20009', '55337', '55408', '27514', '55454',
       '55106', '63108', '61820', '55104', '61801', '02215', '55409', '60201',
       '22902', '80525', '22903', '62901', '10021', '55113', '48103', '11217',
       '55108', '14216', '97301', '94043', '01810', '02139', '78212', '77042',
       '10016', '83814', '22911', '02146', '45218', '53711', '90210', '60089',
       '80123', '14627', '46260', '48197', '10019', '55406', '00000', '68767',
       '99709', '21114', '91711', '85711', '48118', '30067', '91201', '32301',
       '55369', '21218', '01720', '98006', '44212', '10025', '44224', '98072',
       '78704', '55116', '10960', '02154', '20755', '93555', '60630', '33884',
       '83702', '53211', '55346', '38115', '80526', '94306', '91344', 'T8H1N',
       '92629', '49512', '11231', '55422', '92626', '10022', '98027', '78741',
       '53706', '94618', '22206', '94533', '85282', '61755', '60402', '91206',
       '77845', '90034', '50613', '94086'],
      dtype='object')
246 of the users live in these zip codes

**4.3**: Create a new dataset, called `users_filtered`, that includes only entries of users in these top 100 zip codes. **Report the number of samples** in the original dataset and in the new dataset to ensure the desired effect took place

**hint:** Check out the Pandas Series function [isin](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.isin.html)

In [11]:
users_filtered = users[users.zip_code.isin(top_zip_codes)]
print("Before:", len(users))
print("After:", len(users_filtered))

Before: 943
After: 246

**4.5**: What is the minimum, maximum and average age of users in the top 100 zip codes?

In [12]:
print('std:',  users_filtered['age'].std())
print('mean:', users_filtered['age'].mean())
print('min:',  users_filtered['age'].min())
print('max:',  users_filtered['age'].max())
stddev = users_filtered['age'].std()
mean = users_filtered['age'].mean()

std: 12.050015369967758
mean: 33.22357723577236
min: 13
max: 70

**4.6**: How many users in the top 100 zip codes are within one standard deviation of the mean age calculated in **4.5**?

In [14]:
within_std = users_filtered[users_filtered.age.gt(mean - stddev) & users_filtered.age.lt(mean + stddev)]
print(len(within_std), 'of the original', len(users_filtered))

62 of the original 246

**4.7**: How many of the users found in **4.6** are female students?

In [14]:
print(len(within_std[(within_std.gender == 'F') & (within_std.occupation == 'student')]))

9